Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыПоставщикам</xr:Item>
				<xr:Item>AccumulationRegister.ОбеспечениеЗаказовРозницы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаказовПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставкиТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставкиТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставкиC</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыC</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Потолок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыРозницыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыРозницыПоставщикам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказан</Name>
					<Comment>Оформлен заказ поставшику</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получен</Name>
					<Comment>Оформлен проведенный документ поступления от поставщика по заказу розницы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыЗаказовНаПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗаказовНаПроизводство</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПотолка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТиповоеПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перезаказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаказПоставщику/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")
				И ДанныеЗаполнения.Свойство("ТолькоМатериалы") Тогда
				ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения.Основание, ДанныеЗаполнения.ТолькоМатериалы);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПокупателя") Тогда	
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.Монтаж") Тогда
		ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения);
	
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда		
		ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ПерезаполнитьЯчейки(); //nva
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнитьЯчейки()
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.Ячейка = ОбщийМодульДокументы.ПолучитьЯчейку(СтрокаТЧ.Номенклатура, Склад);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ Основание.Пустая() Тогда
		//Всё ок, проверяемые реквизиты комната и назначение оставляем
		
		//#4679
		Если ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара") Тогда
			РеквизитКоличество = ПроверяемыеРеквизиты.Найти("Товары.Количество");
			Если НЕ РеквизитКоличество = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(РеквизитКоличество);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам И ПроверяемыеРеквизиты.Найти("Товары.Комната") <> Неопределено Тогда			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Комната"));
		КонецЕсли;
		
	Иначе
		Если ПроверяемыеРеквизиты.Найти("Товары.Комната") <> Неопределено Тогда			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Комната"));
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("Товары.Назначение") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Назначение"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
	Документы.ЗаказДоговор.ПроверитьКомнатыПоЗаказу(ЭтотОбъект, Отказ, РежимЗаписи);
	
	// №12269
	Документы.ПоступлениеТоваровИУслуг.ПроверитьКоличествоИПлощадьПотолка(ЭтотОбъект, Отказ, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаказыПоставщикам Приход
	Если НЕ Движения.ЗаказыПоставщикам.ВыполнитьПриход(Ссылка, Организация, Товары) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр ЗаказыРозницыПоставщикам
	Движения.ЗаказыРозницыПоставщикам.Записывать = Истина;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") 
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.Монтаж") Тогда
		Если НЕ Основание.Пустая() Тогда
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Движение = Движения.ЗаказыРозницыПоставщикам.Добавить();
				Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
				Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
				Движение.Заказан = ТекущаяСтрока.Количество;
				Движение.ЗаказДоговор = Основание;
				Движение.Период = Дата;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	// регистр РасчетыСКонтрагентами Расход
	Если СуммаДокумента > 0 тогда
		Движения.РасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.РасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 	 = Дата;
		Движение.Заказ 		 = Ссылка;
		Движение.Контрагент  = Контрагент;
		Движение.Организация = Организация;
		Движение.Сумма 		 = СуммаДокумента;
	КонецЕсли;
	
	//регистр Обеспечение заказов Розница
	Если РегистрыНакопления.ОбеспечениеЗаказовРозницы.ТребуетсяЗаписьПоОснованию(Основание) Тогда		
		Движения.ОбеспечениеЗаказовРозницы.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из Товары Цикл
			Если (НЕ ЗначениеЗаполнено(ТекущаяСтрока.Комната) И СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам)
				ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Назначение)
				ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда 
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ОбеспечениеЗаказовРозницы.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Заказ 			= Основание;
			Движение.Период 		= Дата;			
			Движение.Номенклатура 	= ТекущаяСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры 	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
			Движение.Комната 		= ТекущаяСтрока.Комната;
			Движение.Назначение 	= ТекущаяСтрока.Назначение;
			Движение.Количество 	= ТекущаяСтрока.Количество;
			Движение.КоличествоПоФакту = ТекущаяСтрока.Количество;
			//#4679
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда 
				Движение.Количество = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//#16643
	ОбщийМодульСервер.ОжидаемыеПоставки_Рассчитать(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// #16643
	ОбщийМодульСервер.ОжидаемыеПоставки_УдалитьЗаписиПоЗаказу(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14675
	СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам = Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить();
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения, ТолькоМатериалы = Ложь)
	
	Документы.ЗаказНаПроизводство.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);                                    
	
	Валюта 			= ДанныеЗаполнения.Валюта;
	//Комментарий 	= ДанныеЗаполнения.Комментарий; //#5849
	Основание 		= ДанныеЗаполнения.Ссылка;		
	Организация 	= ДанныеЗаполнения.Организация;
	
	Если НЕ ТолькоМатериалы Тогда
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары, 
			"Номенклатура, ХарактеристикаНоменклатуры, Количество, Коэффициент, ЕдиницаИзмерения, Цена, Сумма");
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда 
				НоваяСтрока.Потолок = ?(ДанныеЗаполнения.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка, ДанныеЗаполнения.ПродукцияНоменклатура, Справочники.Номенклатура.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги, 
			"Номенклатура, Количество, Коэффициент, ЕдиницаИзмерения, Цена, Сумма");
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда 
				НоваяСтрока.Потолок = ?(ДанныеЗаполнения.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка, ДанныеЗаполнения.ПродукцияНоменклатура, Справочники.Номенклатура.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;		
	Иначе
		
		Для Каждого ТекСтрокаОснования Из ДанныеЗаполнения.Материалы Цикл
			// #13705 убрана проверка на Вид номенклатуры
			//Если ТекСтрокаОснования.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
			//КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
	
	Организация = ДанныеЗаполнения.Организация;
	Валюта 		= ДанныеЗаполнения.Валюта;
	Основание 	= ДанныеЗаполнения;
	Склад 		= ДанныеЗаполнения.Склад;	
	
	Для Каждого ТекСтрокаОснования Из ДанныеЗаполнения.Товары Цикл
		Если НЕ ТекСтрокаОснования.Номенклатура.Пустая() Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования, "Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Потолок, Комната");
		КонецЕсли;
	КонецЦикла;	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения)
	
	Организация = ДанныеЗаполнения.Организация;
	Валюта 		= ДанныеЗаполнения.Валюта;
	Основание 	= ДанныеЗаполнения;
	
	ДобавлятьТовары 	= Константы.ЗаказПоставщикуЗаказыватьТовары.Получить();
	ДобавлятьМатериалы  = Константы.ЗаказПоставщикуЗаказыватьМатериалы.Получить();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	РегистрыНакопления.ОбеспечениеЗаказовРозницы.ПолучитьОстаткиКОбеспечению(МенеджерВТ, ДанныеЗаполнения, Ссылка, СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Комната КАК Комната,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Товары.Коэффициент КАК Коэффициент,
	|	ВТ_Товары.Назначение КАК Назначение,
	|	ВТ_Товары.НомерПотолка КАК НомерПотолка,
	|	ВТ_Товары.КоличествоКОбеспечению КАК Количество
	|ИЗ
	|	ВТ_ТоварыКОбеспечениюСвернуто КАК ВТ_Товары
	|ГДЕ
	|	ВТ_Товары.КоличествоКОбеспечению > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Материалы.Комната КАК Комната,
	|	ВТ_Материалы.Номенклатура КАК Номенклатура,
	|	ВТ_Материалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Материалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Материалы.Коэффициент КАК Коэффициент,
	|	ВТ_Материалы.Назначение КАК Назначение,
	|	ВТ_Материалы.КоличествоКОбеспечению КАК Количество
	|ИЗ
	|	ВТ_МатериалыКОбеспечениюСвернуто КАК ВТ_Материалы
	|ГДЕ
	|	ВТ_Материалы.КоличествоКОбеспечению > 0";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаТоваров = РезультатЗапроса[0].Выбрать();
	ВыборкаМатериалов = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаТоваров.Следующий() Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ВыборкаТоваров.Номенклатура) Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТоваров);
			//#4679
			Если ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара") Тогда
				НоваяСтрока.Количество = НоваяСтрока.Номенклатура.Потолок_КоличествоПродукция;
			КонецЕсли;
		ИначеЕсли ВыборкаТоваров.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал и ДобавлятьТовары Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТоваров);
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ ПустаяСтрока(ВыборкаТоваров.НомерПотолка) Тогда
				НоваяСтрока.Потолок = Документы.ЗаказДоговор.ПолучитьПотолокОснованияПоНомеру(ДанныеЗаполнения.ТоварыУслуги, ВыборкаТоваров.НомерПотолка);
			КонецЕсли;		
		Иначе
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ ПустаяСтрока(ВыборкаТоваров.НомерПотолка) Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТоваров);
				НоваяСтрока.Потолок = Документы.ЗаказДоговор.ПолучитьПотолокОснованияПоНомеру(ДанныеЗаполнения.ТоварыУслуги, ВыборкаТоваров.НомерПотолка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ДобавлятьМатериалы Тогда
		Пока ВыборкаМатериалов.Следующий() Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаМатериалов);
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
